Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/kata/python-tornado/target_count_13/repeat_19/7.txt
2020/01/26 01:07:48 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8007/
2020/01/26 01:08:18 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 8994 requests
Server Software:        TornadoServer/4.5.3
Server Hostname:        192.168.3.100
Server Port:            8007
Document Path:          /
Document Length:        1000 bytes
Concurrency Level:      100
Time taken for tests:   30.003 seconds
Complete requests:      8994
Failed requests:        0
Total transferred:      10765818 bytes
HTML transferred:       8994000 bytes
Requests per second:    299.77 [#/sec] (mean)
Time per request:       333.591 [ms] (mean)
Time per request:       3.336 [ms] (mean, across all concurrent requests)
Transfer rate:          350.41 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.0      0      22
Processing:     2  330 103.7    335     617
Waiting:        2  330 103.5    334     617
Total:          4  331 103.7    335     618
Percentage of the requests served within a certain time (ms)
  50%    335
  66%    373
  75%    415
  80%    431
  90%    463
  95%    493
  98%    537
  99%    559
 100%    618 (longest request)
2020/01/26 01:08:18 Matched stat line [Connect:        0    1   1.0      0      22 Connect 0 1 1.0 0 22]
2020/01/26 01:08:18 Matched stat line [Processing:     2  330 103.7    335     617 Processing 2 330 103.7 335 617]
2020/01/26 01:08:18 Matched stat line [Waiting:        2  330 103.5    334     617 Waiting 2 330 103.5 334 617]
2020/01/26 01:08:18 Matched stat line [Total:          4  331 103.7    335     618 Total 4 331 103.7 335 618]
2020/01/26 01:08:18 Matched percentline [  50%    335 50 335]
2020/01/26 01:08:18 Matched percentline [  66%    373 66 373]
2020/01/26 01:08:18 Matched percentline [  75%    415 75 415]
2020/01/26 01:08:18 Matched percentline [  80%    431 80 431]
2020/01/26 01:08:18 Matched percentline [  90%    463 90 463]
2020/01/26 01:08:18 Matched percentline [  95%    493 95 493]
{"connect":{"max":22,"mean":1,"median":0,"min":0,"stdDev":1},"percentiles":{"100":618,"50":335,"66":373,"75":415,"80":431,"90":463,"95":493,"98":537,"99":559},"processing":{"max":617,"mean":330,"median":335,"min":2,"stdDev":103.69999694824219},"total":{"max":618,"mean":331,"median":335,"min":4,"stdDev":103.69999694824219},"waiting":{"max":617,"mean":330,"median":334,"min":2,"stdDev":103.5}}
2020/01/26 01:08:18 Matched percentline [  98%    537 98 537]
2020/01/26 01:08:18 Matched percentline [  99%    559 99 559]
2020/01/26 01:08:18 Matched percentline [ 100%    618 100 618]